#+STARTUP: content
#+SEQ_TODO: TODO(t) ONWATCH(o@/!) REVIEW(r@/!) | DONE(d@/!) CANCELLED(c@/!)
#+TAGS: @download(p) @emacs(e) @review(r) @design(d)
#+PROPERTY: header-args :emacs-lisp :tangle ~/.dotfiles/.files/.emacs.d/init.el

#+TITLE: Emacs Configuration
#+AUTHOR: Chloe
#+DATE: 2022-10-29
#+HUGO_SECTION: posts
#+HUGO_BASE_DIR:~/Blog
#+HUGO_TAGS: emacs config
#+hugo_weight: auto
#+HUGO_DRAFT: false
#+hugo_auto_set_lastmod: t

This is the Emacs configuration built from scratch following [[https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&index=1&t=0s][system crafter]]
and [[https://www.youtube.com/watch?v=49kBWM3RQQ8&list=PL9KxKa8NpFxIcNQa9js7dQQIHc81b0-Xg][Mike Zamansky]]'s youtube videos. As someone with only limited
experience in running statistical models in R it's been a confusing
exprience to finally build vague understanding of what's going on
behind the scene.

This literal configuration, by the time the post was written is still
a patchwork of pieces I have taken from different places. My goal is
to taking notes of concepts and syntax along the way when reorganizing
the configuration file so that the documentation will be
self-contained and "dummy-friendly" for people like me who wants to
start using emacs to boost their productivities but have very little
idea of anything relates to programming at the beginning of their
journey.

*** Font and List
The org-font-setup setup the font and also the list style at the end. 
   #+begin_src emacs-lisp
	 (defun org-font-setup ()
		 ;; Replace list hyphen with dot
		 (font-lock-add-keywords 'org-mode
														 '(("^ *\\([-]\\) "
																(0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

		 ;; Set faces for heading levels
		 (dolist (face '((org-level-1 . 1.2)
										 (org-level-2 . 1.1)
										 (org-level-3 . 1.05)
										 (org-level-4 . 1.0)
										 (org-level-5 . 0.8)
										 (org-level-6 . 0.8)
										 (org-level-7 . 0.8)
										 (org-level-8 . 0.8)))
			 (set-face-attribute (car face) nil :font "Fira Code" :weight 'regular :height (cdr face)))

		 ;; Ensure that anything that should be fixed-pitch in Org files appears that way
		 (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
		 (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
		 (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
		 (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
		 (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
		 (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
		 (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

		 (setq org-ellipsis " ▼"
					 org-hide-emphasis-markers t))

	 (add-hook 'org-mode-hook 'org-font-setup)
   #+end_src

	 #+RESULTS:
	 | org-mode-export-hook | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-ref-org-menu | org-pdftools-setup-link | org-tempo-setup | (lambda nil Beautify Org Checkbox Symbol (setq prettify-symbols-alist (cons '([ ] . ☐) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '([X] . ☑) prettify-symbols-alist)) (setq prettify-symbols-alist (cons '([-] . ⊡) prettify-symbols-alist)) (prettify-symbols-mode)) | (lambda nil (org-bullets-mode 1)) | turn-on-visual-line-mode | org-font-setup | er/add-org-mode-expansions | my-org-mode-hook | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | turn-on-auto-fill | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |
	 
**** Installing org-roam-bibtex and hard dependencies
- ~Bibtex-completion~ allows one to access your reference from anywhere
- Org-ref allows one to insert ~'cite:'~ links into the Org-mode buffer.


#+begin_src emacs-lisp
(use-package helm-bibtex)
(use-package org-ref)
#+end_src

#+RESULTS:

The minimalist configuration

#+begin_src emacs-lisp
(setq bibtex-completion-bibliography
      '("/Users/zhouqiaohui/Documents/MyLibrary.bib"))
#+end_src

#+RESULTS:
| /Users/zhouqiaohui/Documents/MyLibrary.bib |

In bibtex, the bibtexcompletion will search for pdf files that have
the suffix same as the BibTex key entry. 

#+begin_src emacs-lisp
(setq bibtex-completion-library-path '("~/Notes/RoamNotes/Paper"))
(setq bibtex-completion-pdf-field "File")
#+end_src

#+RESULTS:
: File


If one file per publication is preferred, bibtex-completion-notes-path
should point to the directory used for storing the notes files:

#+begin_src emacs-lisp
(setq bibtex-completion-notes-path "~/Notes/RoamNotes")
#+end_src

#+RESULTS:
: ~/Notes/RoamNotes

*** Org-roam-graph
#+begin_src emacs-lisp
;;Setting for MacOS
(setq org-roam-graph-viewer
    (lambda (file)
      (let ((org-roam-graph-viewer "/Applications/Arc.app/Contents/MacOS/Arc"))
        (org-roam-graph--open (concat "file://" file)))))
#+end_src

#+RESULTS:
| lambda | (file) | (let ((org-roam-graph-viewer /Applications/Arc.app/Contents/MacOS/Arc)) (org-roam-graph--open (concat file:/wsl$/Ubuntu file))) |

